Tekla.Structures.Model.BaseRebarGroup.RebarGroupSpacingTypeEnum
The ways to distribute the reinforcing bars with different spacings.

Tekla.Structures.Model.BaseRebarGroup.RebarGroupSpacingTypeEnum.SPACING_TYPE_UNDEFINED
The undefined spacing type.

Tekla.Structures.Model.BaseRebarGroup.RebarGroupSpacingTypeEnum.SPACING_TYPE_EXACT_SPACINGS
The bars are distributed using the spacing values.

Tekla.Structures.Model.BaseRebarGroup.RebarGroupSpacingTypeEnum.SPACING_TYPE_EXACT_NUMBER
Equal distribution by the number of reinforcing bars.

Tekla.Structures.Model.BaseRebarGroup.RebarGroupSpacingTypeEnum.SPACING_TYPE_TARGET_SPACE
Equal distribution by the target spacing value.

Tekla.Structures.Model.BaseRebarGroup.RebarGroupSpacingTypeEnum.SPACING_TYPE_EXACT_SPACE_FLEX_AT_START
Distribution by the exact spacing value with a flexible first space.

Tekla.Structures.Model.BaseRebarGroup.RebarGroupSpacingTypeEnum.SPACING_TYPE_EXACT_SPACE_FLEX_AT_END
Distribution by the exact spacing value with a flexible last space.

Tekla.Structures.Model.BaseRebarGroup.RebarGroupSpacingTypeEnum.SPACING_TYPE_EXACT_SPACE_FLEX_AT_BOTH
Distribution by the exact spacing value with flexible first and last spaces.

Tekla.Structures.Model.BaseRebarGroup.RebarGroupSpacingTypeEnum.SPACING_TYPE_EXACT_SPACE_FLEX_AT_MIDDLE
Distribution by the exact spacing value with a flexible middle space.